from datetime import datetime 

# Створення функції в якій буде підрахунок днів
def get_days_from_today(date):
    # Пробуємо зробити операції над введеним рядком, у випадку проблем з форматом дати все що в блоці try не буде виконаним
    try:
        input_date = datetime.strptime(date, "%Y-%m-%d") # Перетворення отриманого рядку в змінну з потрібним форматом
        today_date = datetime.today() # Присвоєння змінній поточної дати
        delta_days = today_date - input_date # Створення змінної та присвоєння їй різниці між поточною датою та датою яка прийшла в функцію з викликом
        
        return delta_days.days #Повертаємо різницю в форматі днів
    except ValueError:
        print("Не вірний формат дати, перевірте що він співпадає з форматом 'РРРР-ММ-ДД'")  # Повідомляємо користувачеві що формат був не вірним :)
        return []

'''
#Перевірка роботи функції   
print(get_days_from_today("2024-07-02"))
'''