import random

#Створення функції з мінімальним числом, максимальним числом, та кількістю чисел

def get_numbers_ticket(min_val, max_val, quantity):

    #Перевірка змінних на відповідність до правила що числа повинні бути від 1 до 1000 та кількістю більшою за 0
    if max_val > 1000 or min_val < 1 or quantity < 0:
        print("Ви ввели не правильні числа, формат введення такий: 'Найменше число не менше 1, найбільше число з можливих не більше 1000, кількість чисел не менше 0")
        return []
    
    #Cтворення списку numbers який буде мати унікальні числа кількістю яку задав користувач
    numbers = random.sample(range(min_val, max_val + 1), quantity)
    return sorted(numbers)

'''
#Виклик функції та виведення результатів
result = get_numbers_ticket(1,1000,1000)
print(result)   
'''


'''
Це була перша ідея і вона мені подобається, але після її створення я згадав про існування sample в random, закоментував цю на пам'ять, вона працює :)

def get_numbers_ticket(min, max, quantity):
    #Перевірка змінних на відповідність до правила що числа повинні бути від 1 до 1000 та кількістю більшою за 0
    if max > 1000 or min < 1 or quantity < 0:
        print("Ви ввели не правильні числа, формат введення такий: 'Найменше число не менше 1, найбільше число з можливих не більше 1000, кількість чисел не менше 0")
        return []
    #Створення сету в якому можуть бути тільки унікальні числа
    numbers = set()
    i = 0
    #Цикл в якому ми створюємо випадкове число і перевірка чи немає такого числа в нашому сеті
    while i < quantity:
        new_number = random.randint(min, max)
        #Якщо згенероване число вже є в сеті ми йдемо генерувати нове
        if new_number in numbers:
            continue
        #Додавання унікального числа в сет відбувається тут
        else:
            numbers.add(new_number)
            i += 1
    #Тут відбувається сортування сету перед поверненням його як результату роботи функції
    sorted_numbers = sorted(numbers)
    return sorted_numbers
'''